Core/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.СкидкиПоНоменклатурнымГруппам</registerRecords>
  <registerRecords>InformationRegister.СкидкиПоНоменклатурам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяЦена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>EnumRef.СпособыОкругления</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНоменклатур</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяЦена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <type>
        <types>EnumRef.СпособыОкругления</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/СкидкиПоНоменклатурам/СкидкиПоНоменклатурам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиПоНоменклатурам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОкругления</name>
    <type>
      <types>EnumRef.СпособыОкругления</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/СкидкиПоНоменклатурнымГруппам/СкидкиПоНоменклатурнымГруппам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиПоНоменклатурнымГруппам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОкругления</name>
    <type>
      <types>EnumRef.СпособыОкругления</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Documents/УстановкаСкидок/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НачалоДня(Дата) > КонецДействия Тогда
		ТекстСообщения = НСтр("ru = 'Начало действия меньше даты окончания!'; ka = 'დაწყების თარიღი მეტია დასრულების თარიღზე!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , "Дата", Отказ);
	КонецЕсли;
	
	Для Каждого СтрокаТЧ ИЗ Запасы Цикл
		Если 		 СтрокаТЧ.ФиксированнаяЦена И НЕ ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаТЧ.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = НСТР("ru = 'В строке номер '; ka = 'სტრიქონში ნომერი '") + Формат(СтрокаТЧ.НомерСтроки, "ЧГ=0") + НСТР("ru = ' не заполнена колонка ""цена"" списка ""запасы""'; ka = ' არ არის შევსებული სვეტი ""ფასი"" სიის ""მარაგები""'");
			Сообщение.Поле =  "Запасы[" + пНомерСтроки + "].Цена";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		ИначеЕсли НЕ СтрокаТЧ.ФиксированнаяЦена И НЕ ЗначениеЗаполнено(СтрокаТЧ.ПроцентСкидки) Тогда
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаТЧ.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = НСТР("ru = 'В строке номер '; ka = 'სტრიქონში ნომერი '") + Формат(СтрокаТЧ.НомерСтроки, "ЧГ=0") + НСТР("ru = ' не заполнена колонка ""% скидки"" списка ""запасы""'; ka = ' არ არის შევსებული სვეტი ""ფასდაკლების %"" სიის ""მარაგები""'");
			Сообщение.Поле =  "Запасы[" + пНомерСтроки + "].ПроцентСкидки";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ ИЗ ГруппыНоменклатур Цикл
		Если 		 СтрокаТЧ.ФиксированнаяЦена И НЕ ЗначениеЗаполнено(СтрокаТЧ.Цена) Тогда
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаТЧ.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = НСТР("ru = 'В строке номер '; ka = 'სტრიქონში ნომერი '") + Формат(СтрокаТЧ.НомерСтроки, "ЧГ=0") + НСТР("ru = ' не заполнена колонка ""цена"" списка ""Группы номенклатур""'; ka = ' არ არის შევსებული სვეტი ""ფასი"" სიის ""ნომენკლატურის ჯგუფები""'");
			Сообщение.Поле =  "ГруппыНоменклатур[" + пНомерСтроки + "].Цена";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		ИначеЕсли НЕ СтрокаТЧ.ФиксированнаяЦена И НЕ ЗначениеЗаполнено(СтрокаТЧ.ПроцентСкидки) Тогда
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаТЧ.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = НСТР("ru = 'В строке номер '; ka = 'სტრიქონში ნომერი '") + Формат(СтрокаТЧ.НомерСтроки, "ЧГ=0") + НСТР("ru = ' не заполнена колонка ""% скидки"" списка ""Группы номенклатур""'; ka = ' არ არის შევსებული სვეტი ""ფასდაკლების %"" სიის ""ნომენკლატურის ჯგუფები""'");
			Сообщение.Поле =  "ГруппыНоменклатур[" + пНомерСтроки + "].ПроцентСкидки";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверкаПередПроведением(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Регистр СкидкиПоНоменклатурам
	Движения.СкидкиПоНоменклатурам.Записывать = Истина;
	Для Каждого ТекСтрокаЗапасы Из Запасы Цикл
		Движение = Движения.СкидкиПоНоменклатурам.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура 		= ТекСтрокаЗапасы.Номенклатура;
		Движение.Характеристика 	= ТекСтрокаЗапасы.Характеристика;
		Движение.КонецДействия 		= КонецДействия;
		Если ТекСтрокаЗапасы.ФиксированнаяЦена Тогда
			Движение.Цена				= ТекСтрокаЗапасы.Цена;
		Иначе
			Движение.ПроцентСкидки		= ТекСтрокаЗапасы.ПроцентСкидки;
			Движение.СпособОкругления 	= ТекСтрокаЗапасы.СпособОкругления;
		КонецЕсли;
	КонецЦикла;

	// Регистр СкидкиПоНоменклатурнымГруппам
	Движения.СкидкиПоНоменклатурнымГруппам.Записывать = Истина;
	Для Каждого ТекСтрокаГруппыНоменклатур Из ГруппыНоменклатур Цикл
		Движение = Движения.СкидкиПоНоменклатурнымГруппам.Добавить();
		Движение.Период = Дата;
		Движение.ГруппаНоменклатуры = ТекСтрокаГруппыНоменклатур.ГруппаНоменклатуры;
		Движение.КонецДействия 		= КонецДействия;
		Если ТекСтрокаГруппыНоменклатур.ФиксированнаяЦена Тогда
			Движение.Цена				= ТекСтрокаГруппыНоменклатур.Цена;
		Иначе
			Движение.ПроцентСкидки 		= ТекСтрокаГруппыНоменклатур.ПроцентСкидки;
			Движение.СпособОкругления 	= ТекСтрокаГруппыНоменклатур.СпособОкругления;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПроверкаПередПроведением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаСкидокЗапасы.Номенклатура КАК Номенклатура,
		|	УстановкаСкидокЗапасы.Характеристика КАК Характеристика,
		|	МИНИМУМ(УстановкаСкидокЗапасы.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ Запасы
		|ИЗ
		|	Документ.УстановкаСкидок.Запасы КАК УстановкаСкидокЗапасы
		|ГДЕ
		|	УстановкаСкидокЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаСкидокЗапасы.Номенклатура,
		|	УстановкаСкидокЗапасы.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕ(СкидкиПоНоменклатурамСрезПоследних.Регистратор) КАК Документ,
		|	СкидкиПоНоменклатурамСрезПоследних.Период КАК НачалоДействия,
		|	СкидкиПоНоменклатурамСрезПоследних.КонецДействия,
		|	ПРЕДСТАВЛЕНИЕ(СкидкиПоНоменклатурамСрезПоследних.Номенклатура) КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(СкидкиПоНоменклатурамСрезПоследних.Характеристика) КАК Характеристика
		|ИЗ
		|	РегистрСведений.СкидкиПоНоменклатурам.СрезПоследних(
		|			,
		|			(Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						Запасы.Номенклатура,
		|						Запасы.Характеристика
		|					ИЗ
		|						Запасы КАК Запасы)
		|				И (Период МЕЖДУ &НачалоДействия И &КонецДействия
		|					ИЛИ КонецДействия МЕЖДУ &НачалоДействия И &КонецДействия
		|					ИЛИ &НачалоДействия МЕЖДУ Период И КонецДействия
		|					ИЛИ &КонецДействия МЕЖДУ Период И КонецДействия)) КАК СкидкиПоНоменклатурамСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Запасы КАК Запасы
		|		ПО СкидкиПоНоменклатурамСрезПоследних.Номенклатура = Запасы.Номенклатура
		|			И СкидкиПоНоменклатурамСрезПоследних.Характеристика = Запасы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаСкидокГруппыНоменклатур.ГруппаНоменклатуры,
		|	МИНИМУМ(УстановкаСкидокГруппыНоменклатур.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ Группы
		|ИЗ
		|	Документ.УстановкаСкидок.ГруппыНоменклатур КАК УстановкаСкидокГруппыНоменклатур
		|ГДЕ
		|	УстановкаСкидокГруппыНоменклатур.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаСкидокГруппыНоменклатур.ГруппаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Группы.НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕ(СкидкиПоНоменклатурнымГруппамСрезПоследних.Регистратор) КАК Документ,
		|	СкидкиПоНоменклатурнымГруппамСрезПоследних.Период КАК НачалоДействия,
		|	СкидкиПоНоменклатурнымГруппамСрезПоследних.КонецДействия,
		|	ПРЕДСТАВЛЕНИЕ(СкидкиПоНоменклатурнымГруппамСрезПоследних.ГруппаНоменклатуры) КАК ГруппаНоменклатуры
		|ИЗ
		|	РегистрСведений.СкидкиПоНоменклатурнымГруппам.СрезПоследних(
		|			,
		|			ГруппаНоменклатуры В
		|					(ВЫБРАТЬ
		|						Группы.ГруппаНоменклатуры
		|					ИЗ
		|						Группы КАК Группы)
		|				И (Период МЕЖДУ &НачалоДействия И &КонецДействия
		|					ИЛИ КонецДействия МЕЖДУ &НачалоДействия И &КонецДействия
		|					ИЛИ &НачалоДействия МЕЖДУ Период И КонецДействия
		|					ИЛИ &КонецДействия МЕЖДУ Период И КонецДействия)) КАК СкидкиПоНоменклатурнымГруппамСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Группы КАК Группы
		|		ПО СкидкиПоНоменклатурнымГруппамСрезПоследних.ГруппаНоменклатуры = Группы.ГруппаНоменклатуры";
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДня(Дата));	
	Запрос.УстановитьПараметр("КонецДействия",	КонецДействия);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНом = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаНом.Следующий() Цикл
		ТекстСообщения = НСтр("ru = 'В текущем интервале  для строки №"+ВыборкаНом.НомерСтроки+" найденна действующая скидка номенклатуры:
                               |Документ: """+ВыборкаНом.Документ+""",
                               |Начало действия: """+Формат(ВыборкаНом.НачалоДействия, "ДФ=dd.MM.yyyy")+ """,
                               |Конец действия: """+Формат(ВыборкаНом.КонецДействия, "ДФ=dd.MM.yyyy")+ """,
                               |Номенклатура: """+ВыборкаНом.Номенклатура+ """,
                               |Характеристика: """+ВыборкаНом.Характеристика+ """'; ka = 'მოცემულ ინტერვალში სტრიქონისთვის №"+ВыборкаНом.НомерСтроки+" მიძებნა მოქმედი ფასდაკლება ნომენკლატურაზე:
                               |დოკუმენტი: """+ВыборкаНом.Документ+""", 
                               |დაწყების თარიღი: """+Формат(ВыборкаНом.НачалоДействия, "ДФ=dd.MM.yyyy")+""",
                               |დასრულების თარიღი: """+Формат(ВыборкаНом.КонецДействия, "ДФ=dd.MM.yyyy")+""",
                               |ნომენკლატურა: """+ВыборкаНом.Номенклатура+""",
                               |მახასიათებელი: """+ВыборкаНом.Характеристика+"""'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , , Отказ);
	КонецЦикла;
	
	ВыборкаНомГруп = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаНомГруп.Следующий() Цикл
		ТекстСообщения = НСтр("ru = 'В текущем интервале  для строки №"+ВыборкаНомГруп.НомерСтроки+" найденна действующая скидка номенклатурной группы:
                               |Документ: """+ВыборкаНомГруп.Документ+""",
                               |Начало действия: """+Формат(ВыборкаНомГруп.НачалоДействия, "ДФ=dd.MM.yyyy")+ """,
                               |Конец действия: """+Формат(ВыборкаНомГруп.КонецДействия, "ДФ=dd.MM.yyyy")+ """,
                               |Группа Номенклатуры: """+ВыборкаНомГруп.ГруппаНоменклатуры+ """'; ka = 'მოცემულ ინტერვალში სტრიქონისთვის №"+ВыборкаНомГруп.НомерСтроки+" მიძებნა მოქმედი ფასდაკლება ნომენკლატურის ჯგუფზე:
                               |დოკუმენტი: """+ВыборкаНомГруп.Документ+""", 
                               |დაწყების თარიღი: """+Формат(ВыборкаНомГруп.НачалоДействия, "ДФ=dd.MM.yyyy")+""",
                               |დასრულების თარიღი: """+Формат(ВыборкаНомГруп.КонецДействия, "ДФ=dd.MM.yyyy")+""",
                               |ნომენკლატურის ჯგუფი: """+ВыборкаНомГруп.ГруппаНоменклатуры+"""'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения, , , , Отказ);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры
